morbos/ada/svd2ada/CMSIS-SVD/NXP/LPC55S6x_mod.svd
        <register>
          <name>CLOCK_CTRL</name>
          <description>Various system clock controls : Flash clock (48 MHz) control, clocks to Frequency Measures</description>
          <addressOffset>0xA18</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x1</resetValue>
          <resetMask>0x3FF</resetMask>
          <fields>
            <field>
              <name>XTAL32MHZ_FREQM_ENA</name>
              <description>Enable XTAL32MHz clock for Frequency Measure module.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>The clock is not enabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>The clock is enabled.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FRO1MHZ_UTICK_ENA</name>
              <description>Enable FRO 1MHz clock for Frequency Measure module and for UTICK.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>The clock is not enabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>The clock is enabled.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FRO12MHZ_FREQM_ENA</name>
              <description>Enable FRO 12MHz clock for Frequency Measure module.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>The clock is not enabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>The clock is enabled.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FRO_HF_FREQM_ENA</name>
              <description>Enable FRO 96MHz clock for Frequency Measure module.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>The clock is not enabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>The clock is enabled.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CLKIN_ENA</name>
              <description>Enable clock_in clock for clock module.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>The clock is not enabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>The clock is enabled.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FRO1MHZ_CLK_ENA</name>
              <description>Enable FRO 1MHz clock for clock muxing in clock gen.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>The clock is not enabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>The clock is enabled.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ANA_FRO12M_CLK_ENA</name>
              <description>Enable FRO 12MHz clock for analog control of the FRO 192MHz.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>The clock is not enabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>The clock is enabled.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>XO_CAL_CLK_ENA</name>
              <description>Enable clock for cristal oscilator calibration.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>The clock is not enabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>The clock is enabled.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PLU_DEGLITCH_CLK_ENA</name>
              <description>Enable clocks FRO_1MHz and FRO_12MHz for PLU deglitching.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>The clock is not enabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>The clock is enabled.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>COMP_INT_CTRL</name>
          <description>Comparator Interrupt control</description>
          <addressOffset>0xB10</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0x3F</resetMask>
          <fields>
            <field>
              <name>INT_ENABLE</name>
              <description>Analog Comparator interrupt enable control:.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INT_DISABLE</name>
                  <description>interrupt disable.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INT_ENABLE</name>
                  <description>interrupt enable.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>INT_CLEAR</name>
              <description>Analog Comparator interrupt clear.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONE</name>
                  <description>No effect.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLEAR</name>
                  <description>Clear the interrupt. Self-cleared bit.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>INT_CTRL</name>
              <description>Comparator interrupt type selector:.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EDGE_DISABLE</name>
                  <description>The analog comparator interrupt edge sensitive is disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LVL_DISABLE</name>
                  <description>The analog comparator interrupt level sensitive is disabled.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EDGE_RISING</name>
                  <description>analog comparator interrupt is rising edge sensitive.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LVL_HIGH</name>
                  <description>Analog Comparator interrupt is high level sensitive.</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EDGE_FALLING</name>
                  <description>analog comparator interrupt is falling edge sensitive.</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LVL_LOW</name>
                  <description>Analog Comparator interrupt is low level sensitive.</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EDGE_BOTH</name>
                  <description>analog comparator interrupt is rising and falling edge sensitive.</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LVL_DIS2</name>
                  <description>The analog comparator interrupt level sensitive is disabled.</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>INT_SOURCE</name>
              <description>Select which Analog comparator output (filtered our un-filtered) is used for interrupt detection.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FILTER_INT</name>
                  <description>Select Analog Comparator filtered output as input for interrupt detection.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RAW_INT</name>
                  <description>Select Analog Comparator raw output (unfiltered) as input for interrupt detection. Must be used when Analog comparator is used as wake up source in Power down mode.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>COMP_INT_STATUS</name>
          <description>Comparator Interrupt status</description>
          <addressOffset>0xB14</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0x7</resetMask>
          <fields>
            <field>
              <name>STATUS</name>
              <description>Interrupt status BEFORE Interrupt Enable.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_INT</name>
                  <description>no interrupt pending.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PENDING</name>
                  <description>interrupt pending.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>INT_STATUS</name>
              <description>Interrupt status AFTER Interrupt Enable.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_INT</name>
                  <description>no interrupt pending.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PENDING</name>
                  <description>interrupt pending.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>VAL</name>
              <description>comparator analog output.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SMALLER</name>
                  <description>P+ is smaller than P-.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GREATER</name>
                  <description>P+ is greater than P-.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
