morbos/ada/svd2ada/CMSIS-SVD/NXP/LPC55S6x_mod.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>IOCON</name>
      <description>I/O pin configuration (IOCON)</description>
      <groupName>IOCON</groupName>
      <baseAddress>0x40001000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x100</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <cluster>
          <dim>32</dim>
          <name>P0[%s]</name>
          <addressOffset>0</addressOffset>
          <description>Digital I/O control for port 0</description>
	  <register>
            <name>PIO0</name>
            <size>32</size>
            <addressOffset>0</addressOffset>
            <access>read-write</access>
            <resetValue>0</resetValue>
            <resetMask>0x7FF</resetMask>
            <fields>
              <field>
		<name>FUNC</name>
		<description>Selects pin function.</description>
		<bitOffset>0</bitOffset>
		<bitWidth>4</bitWidth>
		<access>read-write</access>
		<enumeratedValues>
                  <enumeratedValue>
                    <name>ALT0</name>
                    <description>Alternative connection 0.</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>ALT1</name>
                    <description>Alternative connection 1.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>ALT2</name>
                    <description>Alternative connection 2.</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>ALT3</name>
                    <description>Alternative connection 3.</description>
                    <value>0x3</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>ALT4</name>
                    <description>Alternative connection 4.</description>
                    <value>0x4</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>ALT5</name>
                    <description>Alternative connection 5.</description>
                    <value>0x5</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>ALT6</name>
                    <description>Alternative connection 6.</description>
                    <value>0x6</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>ALT7</name>
                    <description>Alternative connection 7.</description>
                    <value>0x7</value>
                  </enumeratedValue>
		</enumeratedValues>
              </field>
              <field>
		<name>MODE</name>
		<description>Selects function mode (on-chip pull-up/pull-down resistor control).</description>
		<bitOffset>4</bitOffset>
		<bitWidth>2</bitWidth>
		<access>read-write</access>
		<enumeratedValues>
                  <enumeratedValue>
                    <name>INACTIVE</name>
                    <description>Inactive. Inactive (no pull-down/pull-up resistor enabled).</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>PULL_DOWN</name>
                    <description>Pull-down. Pull-down resistor enabled.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>PULL_UP</name>
                    <description>Pull-up. Pull-up resistor enabled.</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>REPEATER</name>
                    <description>Repeater. Repeater mode.</description>
                    <value>0x3</value>
                  </enumeratedValue>
		</enumeratedValues>
              </field>
              <field>
		<name>SLEW</name>
		<description>Driver slew rate.</description>
		<bitOffset>6</bitOffset>
		<bitWidth>1</bitWidth>
		<access>read-write</access>
		<enumeratedValues>
                  <enumeratedValue>
                    <name>STANDARD</name>
                    <description>Standard-mode, output slew rate is slower. More outputs can be switched simultaneously.</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>FAST</name>
                    <description>Fast-mode, output slew rate is faster. Refer to the appropriate specific device data sheet for details.</description>
                    <value>0x1</value>
                  </enumeratedValue>
		</enumeratedValues>
              </field>
              <field>
		<name>INVERT</name>
		<description>Input polarity.</description>
		<bitOffset>7</bitOffset>
		<bitWidth>1</bitWidth>
		<access>read-write</access>
		<enumeratedValues>
                  <enumeratedValue>
                    <name>DISABLED</name>
                    <description>Disabled. Input function is not inverted.</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>ENABLED</name>
                    <description>Enabled. Input is function inverted.</description>
                    <value>0x1</value>
                  </enumeratedValue>
		</enumeratedValues>
              </field>
              <field>
		<name>DIGIMODE</name>
		<description>Select Digital mode.</description>
		<bitOffset>8</bitOffset>
		<bitWidth>1</bitWidth>
		<access>read-write</access>
		<enumeratedValues>
                  <enumeratedValue>
                    <name>ANALOG</name>
                    <description>Disable digital mode. Digital input set to 0.</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>DIGITAL</name>
                    <description>Enable Digital mode. Digital input is enabled.</description>
                    <value>0x1</value>
                  </enumeratedValue>
		</enumeratedValues>
              </field>
              <field>
		<name>OD</name>
		<description>Controls open-drain mode.</description>
		<bitOffset>9</bitOffset>
		<bitWidth>1</bitWidth>
		<access>read-write</access>
		<enumeratedValues>
                  <enumeratedValue>
                    <name>NORMAL</name>
                    <description>Normal. Normal push-pull output</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>OPEN_DRAIN</name>
                    <description>Open-drain. Simulated open-drain output (high drive disabled).</description>
                    <value>0x1</value>
                  </enumeratedValue>
		</enumeratedValues>
              </field>
              <field>
		<name>ASW</name>
		<description>Analog switch input control.</description>
		<bitOffset>10</bitOffset>
		<bitWidth>1</bitWidth>
		<access>read-write</access>
		<enumeratedValues>
                  <enumeratedValue>
                    <name>VALUE0</name>
                    <description>For pins PIO0_9, PIO0_11, PIO0_12, PIO0_15, PIO0_18, PIO0_31, PIO1_0 and PIO1_9, analog switch is closed (enabled). For the other pins, analog switch is open (disabled).</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>VALUE1</name>
                    <description>For all pins except PIO0_9, PIO0_11, PIO0_12, PIO0_15, PIO0_18, PIO0_31, PIO1_0 and PIO1_9 analog switch is closed (enabled)</description>
                    <value>0x1</value>
                  </enumeratedValue>
		</enumeratedValues>
              </field>
            </fields>
          </register>
	</cluster>
        <cluster>
          <dim>32</dim>
          <name>P1[%s]</name>
          <description>Digital I/O control for port 1</description>
          <addressOffset>0x80</addressOffset>
	  <register>
            <name>PIO1</name>
            <size>32</size>
            <addressOffset>0</addressOffset>
            <access>read-write</access>
            <resetValue>0</resetValue>
            <resetMask>0x7FF</resetMask>
            <fields>
              <field>
		<name>FUNC</name>
		<description>Selects pin function.</description>
		<bitOffset>0</bitOffset>
		<bitWidth>4</bitWidth>
		<access>read-write</access>
		<enumeratedValues>
                  <enumeratedValue>
                    <name>ALT0</name>
                    <description>Alternative connection 0.</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>ALT1</name>
                    <description>Alternative connection 1.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>ALT2</name>
                    <description>Alternative connection 2.</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>ALT3</name>
                    <description>Alternative connection 3.</description>
                    <value>0x3</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>ALT4</name>
                    <description>Alternative connection 4.</description>
                    <value>0x4</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>ALT5</name>
                    <description>Alternative connection 5.</description>
                    <value>0x5</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>ALT6</name>
                    <description>Alternative connection 6.</description>
                    <value>0x6</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>ALT7</name>
                    <description>Alternative connection 7.</description>
                    <value>0x7</value>
                  </enumeratedValue>
		</enumeratedValues>
              </field>
              <field>
		<name>MODE</name>
		<description>Selects function mode (on-chip pull-up/pull-down resistor control).</description>
		<bitOffset>4</bitOffset>
		<bitWidth>2</bitWidth>
		<access>read-write</access>
		<enumeratedValues>
                  <enumeratedValue>
                    <name>INACTIVE</name>
                    <description>Inactive. Inactive (no pull-down/pull-up resistor enabled).</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>PULL_DOWN</name>
                    <description>Pull-down. Pull-down resistor enabled.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>PULL_UP</name>
                    <description>Pull-up. Pull-up resistor enabled.</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>REPEATER</name>
                    <description>Repeater. Repeater mode.</description>
                    <value>0x3</value>
                  </enumeratedValue>
		</enumeratedValues>
              </field>
              <field>
		<name>SLEW</name>
		<description>Driver slew rate.</description>
		<bitOffset>6</bitOffset>
		<bitWidth>1</bitWidth>
		<access>read-write</access>
		<enumeratedValues>
                  <enumeratedValue>
                    <name>STANDARD</name>
                    <description>Standard-mode, output slew rate is slower. More outputs can be switched simultaneously.</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>FAST</name>
                    <description>Fast-mode, output slew rate is faster. Refer to the appropriate specific device data sheet for details.</description>
                    <value>0x1</value>
                  </enumeratedValue>
		</enumeratedValues>
              </field>
              <field>
		<name>INVERT</name>
		<description>Input polarity.</description>
		<bitOffset>7</bitOffset>
		<bitWidth>1</bitWidth>
		<access>read-write</access>
		<enumeratedValues>
                  <enumeratedValue>
                    <name>DISABLED</name>
                    <description>Disabled. Input function is not inverted.</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>ENABLED</name>
                    <description>Enabled. Input is function inverted.</description>
                    <value>0x1</value>
                  </enumeratedValue>
		</enumeratedValues>
              </field>
              <field>
		<name>DIGIMODE</name>
		<description>Select Digital mode.</description>
		<bitOffset>8</bitOffset>
		<bitWidth>1</bitWidth>
		<access>read-write</access>
		<enumeratedValues>
                  <enumeratedValue>
                    <name>ANALOG</name>
                    <description>Disable digital mode. Digital input set to 0.</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>DIGITAL</name>
                    <description>Enable Digital mode. Digital input is enabled.</description>
                    <value>0x1</value>
                  </enumeratedValue>
		</enumeratedValues>
              </field>
              <field>
		<name>OD</name>
		<description>Controls open-drain mode.</description>
		<bitOffset>9</bitOffset>
		<bitWidth>1</bitWidth>
		<access>read-write</access>
		<enumeratedValues>
                  <enumeratedValue>
                    <name>NORMAL</name>
                    <description>Normal. Normal push-pull output</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>OPEN_DRAIN</name>
                    <description>Open-drain. Simulated open-drain output (high drive disabled).</description>
                    <value>0x1</value>
                  </enumeratedValue>
		</enumeratedValues>
              </field>
              <field>
		<name>ASW</name>
		<description>Analog switch input control.</description>
		<bitOffset>10</bitOffset>
		<bitWidth>1</bitWidth>
		<access>read-write</access>
		<enumeratedValues>
                  <enumeratedValue>
                    <name>VALUE0</name>
                    <description>For pins PIO0_9, PIO0_11, PIO0_12, PIO0_15, PIO0_18, PIO0_31, PIO1_0 and PIO1_9, analog switch is closed (enabled). For the other pins, analog switch is open (disabled).</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>VALUE1</name>
                    <description>For all pins except PIO0_9, PIO0_11, PIO0_12, PIO0_15, PIO0_18, PIO0_31, PIO1_0 and PIO1_9 analog switch is closed (enabled)</description>
                    <value>0x1</value>
                  </enumeratedValue>
		</enumeratedValues>
              </field>
            </fields>
          </register>
	</cluster>
