morbos/ada/svd2ada/CMSIS-SVD/NXP/LPC55S6x_mod.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>SYSCTL</name>
      <description>system controller</description>
      <groupName>SYSCTL</groupName>
      <baseAddress>0x40023000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x104</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>UPDATELCKOUT</name>
          <description>update lock out control</description>
          <addressOffset>0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>UPDATELCKOUT</name>
              <description>All Registers</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NORMAL_MODE</name>
                  <description>Normal Mode. Can be written to.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PROTECTED_MODE</name>
                  <description>Protected Mode. Cannot be written to.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <dim>8</dim>
          <dimIncrement>0x4</dimIncrement>
          <dimIndex>0,1,2,3,4,5,6,7</dimIndex>
          <name>FCCTRLSEL%s</name>
          <description>Selects the source for SCK going into Flexcomm 0</description>
          <addressOffset>0x40</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0x3030303</resetMask>
          <fields>
            <field>
              <name>SCKINSEL</name>
              <description>Selects the source for SCK going into this Flexcomm.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-writeOnce</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ORIG_FLEX_I2S_SIGNALS</name>
                  <description>Selects the dedicated FCn_SCK function for this Flexcomm.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SHARED_SET0_I2S_SIGNALS</name>
                  <description>SCK is taken from shared signal set 0 (defined by SHAREDCTRLSET0).</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SHARED_SET1_I2S_SIGNALS</name>
                  <description>SCK is taken from shared signal set 1 (defined by SHAREDCTRLSET1).</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WSINSEL</name>
              <description>Selects the source for WS going into this Flexcomm.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ORIG_FLEX_I2S_SIGNALS</name>
                  <description>Selects the dedicated (FCn_TXD_SCL_MISO_WS) function for this Flexcomm.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SHARED_SET0_I2S_SIGNALS</name>
                  <description>WS is taken from shared signal set 0 (defined by SHAREDCTRLSET0).</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SHARED_SET1_I2S_SIGNALS</name>
                  <description>WS is taken from shared signal set 1 (defined by SHAREDCTRLSET1).</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DATAINSEL</name>
              <description>Selects the source for DATA input to this Flexcomm.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ORIG_FLEX_I2S_SIGNALS</name>
                  <description>Selects the dedicated FCn_RXD_SDA_MOSI_DATA input for this Flexcomm.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SHARED_SET0_I2S_SIGNALS</name>
                  <description>Input data is taken from shared signal set 0 (defined by SHAREDCTRLSET0).</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SHARED_SET1_I2S_SIGNALS</name>
                  <description>Input data is taken from shared signal set 1 (defined by SHAREDCTRLSET1).</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DATAOUTSEL</name>
              <description>Selects the source for DATA output from this Flexcomm.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ORIG_FLEX_I2S_SIGNALS</name>
                  <description>Selects the dedicated FCn_RXD_SDA_MOSI_DATA output from this Flexcomm.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SHARED_SET0_I2S_SIGNALS</name>
                  <description>Output data is taken from shared signal set 0 (defined by SHAREDCTRLSET0).</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SHARED_SET1_I2S_SIGNALS</name>
                  <description>Output data is taken from shared signal set 1 (defined by SHAREDCTRLSET1).</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <dim>2</dim>
          <dimIncrement>0x4</dimIncrement>
          <dimIndex>0,1</dimIndex>
          <name>SHAREDCTRLSET%s</name>
          <description>Selects sources and data combinations for shared signal set 0.</description>
          <addressOffset>0x80</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFF0777</resetMask>
          <fields>
            <field>
              <name>SHAREDSCKSEL</name>
              <description>Selects the source for SCK of this shared signal set.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FLEXCOMM0</name>
                  <description>SCK for this shared signal set comes from Flexcomm 0.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FLEXCOMM1</name>
                  <description>SCK for this shared signal set comes from Flexcomm 1.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FLEXCOMM2</name>
                  <description>SCK for this shared signal set comes from Flexcomm 2.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FLEXCOMM3</name>
                  <description>SCK for this shared signal set comes from Flexcomm 3.</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FLEXCOMM4</name>
                  <description>SCK for this shared signal set comes from Flexcomm 4.</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FLEXCOMM5</name>
                  <description>SCK for this shared signal set comes from Flexcomm 5.</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FLEXCOMM6</name>
                  <description>SCK for this shared signal set comes from Flexcomm 6.</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FLEXCOMM7</name>
                  <description>SCK for this shared signal set comes from Flexcomm 7.</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SHAREDWSSEL</name>
              <description>Selects the source for WS of this shared signal set.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FLEXCOMM0</name>
                  <description>WS for this shared signal set comes from Flexcomm 0.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FLEXCOMM1</name>
                  <description>WS for this shared signal set comes from Flexcomm 1.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FLEXCOMM2</name>
                  <description>WS for this shared signal set comes from Flexcomm 2.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FLEXCOMM3</name>
                  <description>WS for this shared signal set comes from Flexcomm 3.</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FLEXCOMM4</name>
                  <description>WS for this shared signal set comes from Flexcomm 4.</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FLEXCOMM5</name>
                  <description>WS for this shared signal set comes from Flexcomm 5.</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FLEXCOMM6</name>
                  <description>WS for this shared signal set comes from Flexcomm 6.</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FLEXCOMM7</name>
                  <description>WS for this shared signal set comes from Flexcomm 7.</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SHAREDDATASEL</name>
              <description>Selects the source for DATA input for this shared signal set.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FLEXCOMM0</name>
                  <description>DATA input for this shared signal set comes from Flexcomm 0.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FLEXCOMM1</name>
                  <description>DATA input for this shared signal set comes from Flexcomm 1.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FLEXCOMM2</name>
                  <description>DATA input for this shared signal set comes from Flexcomm 2.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FLEXCOMM3</name>
                  <description>DATA input for this shared signal set comes from Flexcomm 3.</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FLEXCOMM4</name>
                  <description>DATA input for this shared signal set comes from Flexcomm 4.</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FLEXCOMM5</name>
                  <description>DATA input for this shared signal set comes from Flexcomm 5.</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FLEXCOMM6</name>
                  <description>DATA input for this shared signal set comes from Flexcomm 6.</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FLEXCOMM7</name>
                  <description>DATA input for this shared signal set comes from Flexcomm 7.</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FC0DATAOUTEN</name>
              <description>Controls FC0 contribution to SHAREDDATAOUT for this shared set.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INPUT</name>
                  <description>Data output from FC0 does not contribute to this shared set.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OUTPUT</name>
                  <description>Data output from FC0 does contribute to this shared set.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FC1DATAOUTEN</name>
              <description>Controls FC1 contribution to SHAREDDATAOUT for this shared set.</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INPUT</name>
                  <description>Data output from FC1 does not contribute to this shared set.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OUTPUT</name>
                  <description>Data output from FC1 does contribute to this shared set.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FC2DATAOUTEN</name>
              <description>Controls FC2 contribution to SHAREDDATAOUT for this shared set.</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INPUT</name>
                  <description>Data output from FC2 does not contribute to this shared set.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OUTPUT</name>
                  <description>Data output from FC2 does contribute to this shared set.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FC4DATAOUTEN</name>
              <description>Controls FC4 contribution to SHAREDDATAOUT for this shared set.</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INPUT</name>
                  <description>Data output from FC4 does not contribute to this shared set.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OUTPUT</name>
                  <description>Data output from FC4 does contribute to this shared set.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FC5DATAOUTEN</name>
              <description>Controls FC5 contribution to SHAREDDATAOUT for this shared set.</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INPUT</name>
                  <description>Data output from FC5 does not contribute to this shared set.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OUTPUT</name>
                  <description>Data output from FC5 does contribute to this shared set.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FC6DATAOUTEN</name>
              <description>Controls FC6 contribution to SHAREDDATAOUT for this shared set.</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INPUT</name>
                  <description>Data output from FC6 does not contribute to this shared set.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OUTPUT</name>
                  <description>Data output from FC6 does contribute to this shared set.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FC7DATAOUTEN</name>
              <description>Controls FC7 contribution to SHAREDDATAOUT for this shared set.</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INPUT</name>
                  <description>Data output from FC7 does not contribute to this shared set.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OUTPUT</name>
                  <description>Data output from FC7 does contribute to this shared set.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>USB_HS_STATUS</name>
          <description>Status register for USB HS</description>
          <addressOffset>0x100</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0x1C0FF00</resetMask>
          <fields>
            <field>
              <name>USBHS_3V_NOK</name>
              <description>USB_HS: Low voltage detection on 3.3V supply.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SUPPLY_3V_OK</name>
                  <description>3v3 supply is good.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SUPPLY_3V_LOW</name>
                  <description>3v3 supply is too low.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
